src/test/resources/request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:CelsiusToFahrenheit xmlns:ns2="http://www.w3schools.com/xml/">
            <ns2:Celsius>34</ns2:Celsius>
        </ns2:CelsiusToFahrenheit>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>